{
    "ants": [
        "Add insecticides like permethrin or diatomaceous earth to your plant’s soil, or set ant traps armed with pesticides in or around the pot.",
        "Submerge the pot in a mixture of water and dish soap for 15 minutes to flush out the ants.",
        "Repot any plants with particularly stubborn or uncontrollable infestations, washing the pot with warm water and bleach, then adding fresh potting soil.",
        "Deter ants with natural household items like essential oils, coffee grounds, or cinnamon, or set up a sticky trap around the base of the pot."
    ],
    "bees": [
        "1. Avoid planting strong-scented flowers",
        "2. Keep the area dry",
        "3. Use essential oils",
        "4. Try soap & water",
        "5. Sprinkle baby powder",
        "6. Harness the power of garlic",
        "7. Versatile vinegar"
    ],
    "moth": [
        "1.   Thinning Your Apple Crop",
        "2.   Picking Up Dropped Apples",
        "3.   Trapping Moths",
        "4.   Trapping Caterpillars",
        "5.   Bagging",
        "6.   Biological Control: Trichogramma Wasps",
        "7.   Natural Predators: Birds",
        "8.   Biological Control: Codling Moth Virus"
    ],
    "slug": [
        "2.  Grab Them!",
        "3.  Traps",
        "4.  Barriers",
        "5.  Natural Predators",
        "6.  Caffeine",
        "7.  An Alternative Slug Bait"
    ],
    "snail": [
        "\nMake your garden a haven for natural snail predators such as birds, frogs, toads, and ground beetles.\nHandpick and destroy snails by dropping them in a jar of soapy water. You'll capture more if you go \"hunting\" at night. Use a slug trap or fill shallow containers with beer and sink them into the soil to trap slugs and snails.\nIn the evening, set out food traps such as cabbage leaves and pieces of potato. In the morning, destroy the snails that have gathered in the traps.\n"
    ],
    "wasp": [
        "\n\nEncourage Natural Predators: Birds and other wildlife can help control wasp populations.\n\nPlant Wasp-Repelling Herbs: Grow mint, citronella, or eucalyptus around your garden to deter wasps.\n\nInstall Screens and Barriers: Use mesh screens on doors and windows to prevent wasps from entering your home.\n"
    ],
    "weevil": [
        "\nCrop Rotation: Alternate crops such as alfalfa with cereals. Rotation interrupts the weevil life cycle, causing dramatic population reductions. For rice water weevil, non-rice years help break its cycle.\nField Sanitation: Remove plant residues, post-harvest debris, and weeds promptly. This eliminates habitats for overwintering adults and reduces food sources for larvae.\nHarvest Timing for Alfalfa: Harvesting alfalfa 7-10 days before normal bloom can decrease weevil larvae by ~95%. Early cuttings prevent larvae from reaching damaging populations.\nWater Management in Rice: Draining rice fields after flooding can expose larvae and eggs, reducing rice water weevil damage.\n"
    ],
    "beetle": [
        "\nFill yellow pails or yellow plastic butter dishes with soapy water. Beetles will fly in and drown. ",
        "\nBuy traps. Yellow sticky traps work well, or you can buy traps specifically designed to catch cucumber beetles. ",
        "\nSpray an insecticide, such as Ortho® Insect, Mite & Disease 3-in-1, following label instructions carefully. Spray blooming plants in the early morning or in the evening, when beneficial pollinators are less likely to be active."
    ],
    "catterpillar": [
        "Look for feeding holes, excrement, webbed or rolled leaves, caterpillars, and eggs. ",
        "Prune off rolled or webbed leaves  and handpick caterpillars from plants.   Destroy  the insects by crushing them or by dropping them into soapy water.",
        "Beneficial insects and other organisms often keep caterpillars under control..",
        "Most caterpillar species have several species of parasitic wasps or flies that attack them. Look for parasite cocoons next to or on caterpillars, darkened caterpillar eggs, or exit holes in dead caterpillars.",
        "General predators include birds, assassin bugs, lacewings, predaceous ground beetles, and spiders.",
        "Naturally occurring diseases caused by viruses, bacteria, or fungi often kill caterpillars.",
        "Use insecticides only when damage is intolerable, nonchemical methods haven't worked, and smaller caterpillars are present. Avoid insecticides that can kill beneficial insects.   Don't treat butterfly garden plants, otherwise you'll kill the caterpillars that will become butterflies.",
        "Bacillus thuringiensis subspecies kurstaki (Btk) is a microbial insecticide that kills only caterpillars. It’s safe to use near bees, beneficial insects, and wildlife. Caterpillars must feed on treated leaves to be affected. Because  Btk is most effective on small, newly hatched caterpillars and breaks down rapidly, treatment timing is critical.",
        "Spinosad is a microbial-based insecticide but can have negative impacts on some beneficial insects."
    ],
    "earthworms": [
        "Earthworms (Image A) become active when the ground thaws and will have multiple generations per season. Activity will slow down in late October as the ground temperature decreases.",
        "Notes: Earthworms are only a problem on tees, greens and short-mowed fairways with heavy soils. They are desirable in home lawns and most turfgrass sites because they mix the soil and help decompose thatch."
    ],
    "earwig": [
        "\nSanitation: Regularly remove plant debris, weeds, and fallen fruits from the field to eliminate potential hiding spots.\nMulching: Use dry mulch instead of moist mulch to discourage earwig activity in the planting area.\nCrop Rotation: Rotate crops annually to disrupt earwig breeding and feeding patterns.\n",
        "\nStraw Traps: Place damp straw or newspaper near the base of crops. Earwigs will seek shelter there during the day, allowing you to collect and remove them.\nCardboard Traps: Similarly, cardboard traps coated with petroleum jelly can be effective in capturing earwigs.\n",
        "\nBirds, Toads, And Frogs: Encourage these natural predators to inhabit your fields to feed on earwigs.\nBeneficial Insects: Release beneficial insects like ground beetles and predatory wasps, which will target earwig eggs and nymphs.\n",
        "\nArtificial Lights: Reduce the use of bright lights around fields as earwigs are attracted to light at night.\nWater Management: Avoid over-irrigation, as excess moisture creates a favourable habitat for earwigs.\n"
    ],
    "grasshopper": [
        "1.    Hand Pick Insects & Protect Plants",
        "2.    Grow a Green Border",
        "3.    Natural Predators",
        "4.    Neem Oil",
        "5.   Traps",
        "6.    Nosema Locustae Bait\n"
    ]
}